SoftmaxRegression(
  (linear): Linear(in_features=150, out_features=3, bias=True)
)
SoftmaxRegression(
  (linear): Linear(in_features=150, out_features=3, bias=True)
)
SoftmaxRegression(
  (linear): Linear(in_features=150, out_features=3, bias=True)
)
SoftmaxRegression(
  (linear): Linear(in_features=150, out_features=3, bias=True)
)
SoftmaxRegression(
  (linear): Linear(in_features=150, out_features=3, bias=True)
)